{
    "fr": {
        "title": "Politique de Confidentialité pour Stocky pêche",
        "lastUpdated": "Dernière mise à jour : 22 janvier 2025",
        "intro": "Cette Politique de Confidentialité décrit mes politiques et procédures concernant la collecte, l'utilisation et la divulgation de vos informations lorsque vous utilisez mon Service. Elle vous informe également sur vos droits en matière de confidentialité et sur la manière dont la loi vous protège.",
        "interpretation": "Interprétation et Définitions",
        "interpretationText": "Les mots dont la première lettre est en majuscule ont des significations définies dans les conditions suivantes. Les définitions suivantes ont la même signification, qu'elles apparaissent au singulier ou au pluriel.",
        "definitions": "Définitions",
        "definitionsText": "Aux fins de cette Politique de Confidentialité :",
        "account": "Compte",
        "accountDefinition": "désigne un compte unique créé pour vous permettre d'accéder à mon Service ou à certaines parties de mon Service.",
        "application": "Application",
        "applicationDefinition": "désigne Stocky pêche, le programme logiciel que j'ai développé.",
        "developer": "Développeur",
        "developerDefinition": "(désigné soit par \"Moi\", \"Je\" ou \"Mon\" dans cet Accord) désigne Maaye Bouha, le développeur responsable de la création et de la maintenance de l'Application.",
        "country": "Pays",
        "countryDefinition": "désigne : Mauritanie.",
        "device": "Appareil",
        "deviceDefinition": "désigne tout appareil pouvant accéder au Service, tel qu'un ordinateur, un téléphone portable ou une tablette numérique.",
        "personalData": "Données Personnelles",
        "personalDataDefinition": "désigne toute information se rapportant à une personne identifiée ou identifiable.",
        "service": "Service",
        "serviceDefinition": "désigne l'Application.",
        "serviceProvider": "Fournisseur de Services",
        "serviceProviderDefinition": "désigne toute personne physique ou morale qui traite les données pour mon compte. Il désigne des tiers ou des individus employés pour faciliter le Service, fournir le Service en mon nom, exécuter des services liés au Service ou m'aider à analyser la manière dont le Service est utilisé.",
        "usageData": "Données d'Utilisation",
        "usageDataDefinition": "désigne les données collectées automatiquement, générées par l'utilisation du Service ou par l'infrastructure du Service elle-même (par exemple, la durée de visite d'une page).",
        "you": "Vous",
        "youDefinition": "désigne la personne accédant ou utilisant le Service, ou la société, ou toute autre entité juridique au nom de laquelle cette personne accède ou utilise le Service, selon le cas.",
        "collectingData": "Collecte et Utilisation de Vos Données Personnelles",
        "typesOfData": "Types de Données Collectées",
        "personalDataSection": "Données Personnelles",
        "personalDataSectionText": "Lorsque vous utilisez mon Service, je peux vous demander de me fournir certaines informations personnelles identifiables qui peuvent être utilisées pour vous contacter ou vous identifier. Les informations personnelles identifiables peuvent inclure, mais sans s'y limiter :",
        "personalDataList": [
            "Prénom et nom",
            "Numéro de téléphone",
            "Adresse, État, Province, Code postal, Ville",
            "Données d'Utilisation"
        ],
        "usageDataSection": "Données d'Utilisation",
        "usageDataSectionText": "Les Données d'Utilisation sont collectées automatiquement lors de l'utilisation du Service.",
        "usageDataDetails": "Les Données d'Utilisation peuvent inclure des informations telles que l'adresse IP de votre appareil, le type de navigateur, la version du navigateur, les pages de mon Service que vous visitez, l'heure et la date de votre visite, le temps passé sur ces pages, des identifiants uniques d'appareil et d'autres données de diagnostic.",
        "mobileUsage": "Lorsque vous accédez au Service par ou via un appareil mobile, je peux collecter certaines informations automatiquement, y compris, mais sans s'y limiter, le type d'appareil mobile que vous utilisez, l'identifiant unique de votre appareil mobile, l'adresse IP de votre appareil mobile, votre système d'exploitation mobile, le type de navigateur Internet mobile que vous utilisez, des identifiants uniques d'appareil et d'autres données de diagnostic.",
        "browserData": "Je peux également collecter des informations que votre navigateur envoie chaque fois que vous visitez mon Service ou lorsque vous accédez au Service par ou via un appareil mobile.",
        "useOfData": "Utilisation de Vos Données Personnelles",
        "useOfDataText": "Je peux utiliser les Données Personnelles aux fins suivantes :",
        "useOfDataList": [
            "Pour fournir et maintenir mon Service, y compris pour surveiller l'utilisation de mon Service.",
            "Pour gérer votre Compte : pour gérer votre inscription en tant qu'utilisateur du Service. Les Données Personnelles que vous fournissez peuvent vous donner accès à différentes fonctionnalités du Service qui sont disponibles pour vous en tant qu'utilisateur enregistré.",
            "Pour vous contacter : Pour vous contacter par e-mail, appels téléphoniques, SMS ou autres formes équivalentes de communication électronique, telles que les notifications push d'une application mobile concernant des mises à jour ou des communications informatives liées aux fonctionnalités, produits ou services sous contrat, y compris les mises à jour de sécurité, lorsque cela est nécessaire ou raisonnable pour leur mise en œuvre.",
            "Pour vous fournir des nouvelles, des offres spéciales et des informations générales sur d'autres biens, services et événements que je propose et qui sont similaires à ceux que vous avez déjà achetés ou sur lesquels vous vous êtes renseigné, sauf si vous avez choisi de ne pas recevoir de telles informations.",
            "Pour gérer vos demandes : Pour répondre et gérer vos demandes auprès de moi.",
            "Pour d'autres finalités : Je peux utiliser vos informations à d'autres fins, telles que l'analyse de données, l'identification des tendances d'utilisation, la détermination de l'efficacité de mes campagnes promotionnelles et pour évaluer et améliorer mon Service, mes produits, mes services, mon marketing et votre expérience."
        ],
        "sharingData": "Partage de Vos Données Personnelles",
        "sharingDataText": "Je peux partager vos informations personnelles dans les situations suivantes :",
        "sharingDataList": [
            "Avec des Fournisseurs de Services : Je peux partager vos informations personnelles avec des Fournisseurs de Services pour surveiller et analyser l'utilisation de mon Service, pour vous contacter.",
            "Avec votre consentement : Je peux divulguer vos informations personnelles à toute autre fin avec votre consentement."
        ],
        "retention": "Conservation de Vos Données Personnelles",
        "retentionText": "Je conserverai vos Données Personnelles uniquement aussi longtemps que nécessaire pour les finalités décrites dans cette Politique de Confidentialité. Je conserverai et utiliserai vos Données Personnelles dans la mesure nécessaire pour respecter mes obligations légales (par exemple, si je suis tenu de conserver vos données pour respecter les lois applicables), résoudre les litiges et faire respecter mes accords et politiques juridiques.",
        "retentionUsageData": "Je conserverai également les Données d'Utilisation à des fins d'analyse interne. Les Données d'Utilisation sont généralement conservées pour une période plus courte, sauf lorsque ces données sont utilisées pour renforcer la sécurité ou améliorer la fonctionnalité de mon Service, ou lorsque je suis légalement obligé de conserver ces données pour des périodes plus longues.",
        "transfer": "Transfert de Vos Données Personnelles",
        "transferText": "Vos informations, y compris les Données Personnelles, sont traitées à mon bureau et dans tout autre lieu où les parties impliquées dans le traitement sont situées. Cela signifie que ces informations peuvent être transférées vers — et conservées sur — des ordinateurs situés en dehors de votre état, province, pays ou autre juridiction gouvernementale où les lois sur la protection des données peuvent différer de celles de votre juridiction.",
        "transferConsent": "Votre consentement à cette Politique de Confidentialité suivi de votre soumission de ces informations représente votre accord à ce transfert.",
        "transferSecurity": "Je prendrai toutes les mesures raisonnablement nécessaires pour m'assurer que vos données sont traitées de manière sécurisée et conformément à cette Politique de Confidentialité, et aucun transfert de vos Données Personnelles n'aura lieu vers une organisation ou un pays à moins qu'il n'y ait des contrôles adéquats en place, y compris la sécurité de vos données et autres informations personnelles.",
        "deletion": "Suppression de Vos Données Personnelles",
        "deletionText": "Vous avez le droit de supprimer ou de demander que je vous aide à supprimer les Données Personnelles que j'ai collectées à votre sujet.",
        "deletionService": "Mon Service peut vous donner la possibilité de supprimer certaines informations vous concernant à partir du Service.",
        "deletionAccount": "Vous pouvez mettre à jour, modifier ou supprimer vos informations à tout moment en vous connectant à votre Compte, si vous en avez un, et en visitant la section des paramètres du compte qui vous permet de gérer vos informations personnelles. Vous pouvez également me contacter pour demander l'accès, la correction ou la suppression de toute information personnelle que vous m'avez fournie.",
        "deletionNote": "Veuillez noter, cependant, que je peux être obligé de conserver certaines informations lorsque j'ai une obligation légale ou une base légale pour le faire.",
        "disclosure": "Divulgation de Vos Données Personnelles",
        "disclosureLaw": "Application de la Loi",
        "disclosureLawText": "Dans certaines circonstances, je peux être obligé de divulguer vos Données Personnelles si la loi l'exige ou en réponse à des demandes valides des autorités publiques (par exemple, un tribunal ou une agence gouvernementale).",
        "disclosureLegal": "Autres Obligations Légales",
        "disclosureLegalText": "Je peux divulguer vos Données Personnelles si je crois de bonne foi que cette action est nécessaire pour :",
        "disclosureLegalList": [
            "Se conformer à une obligation légale",
            "Protéger et défendre mes droits ou mes biens",
            "Prévenir ou enquêter sur d'éventuels actes répréhensibles en lien avec le Service",
            "Protéger la sécurité personnelle des utilisateurs du Service ou du public",
            "Se protéger contre la responsabilité légale"
        ],
        "security": "Sécurité de Vos Données Personnelles",
        "securityText": "La sécurité de vos Données Personnelles est importante pour moi, mais rappelez-vous qu'aucune méthode de transmission sur Internet ou méthode de stockage électronique n'est sûre à 100 %. Bien que je m'efforce d'utiliser des moyens commercialement acceptables pour protéger vos Données Personnelles, je ne peux pas garantir leur sécurité absolue.",
        "childrenPrivacy": "Confidentialité des Enfants",
        "childrenPrivacyText": "Mon Service ne s'adresse à personne de moins de 13 ans. Je ne collecte pas sciemment d'informations personnelles identifiables de quiconque de moins de 13 ans. Si vous êtes un parent ou un tuteur et que vous savez que votre enfant m'a fourni des Données Personnelles, veuillez me contacter. Si j'apprends que j'ai collecté des Données Personnelles de quiconque de moins de 13 ans sans vérification du consentement parental, je prends des mesures pour supprimer ces informations de mes serveurs.",
        "childrenConsent": "Si je dois me appuyer sur le consentement comme base légale pour le traitement de vos informations et que votre country exige le consentement d'un parent, je peux exiger le consentement de votre parent avant de collecter et d'utiliser ces informations.",
        "links": "Liens vers d'Autres Sites Web",
        "linksText": "Mon Service peut contenir des liens vers d'autres sites web qui ne sont pas exploités par moi. Si vous cliquez sur un lien tiers, vous serez dirigé vers le site de ce tiers. Je vous conseille vivement de consulter la Politique de Confidentialité de chaque site que vous visitez.",
        "linksResponsibility": "Je n'ai aucun contrôle sur et n'assume aucune responsabilité pour le contenu, les politiques de confidentialité ou les pratiques de tout site ou service tiers.",
        "changes": "Modifications de cette Politique de Confidentialité",
        "changesText": "Je peux mettre à jour ma Politique de Confidentialité de temps à autre. Je vous informerai de tout changement en publiant la nouvelle Politique de Confidentialité sur cette page.",
        "changesAdvice": "Je vous conseille de consulter cette Politique de Confidentialité périodiquement pour tout changement. Les modifications à cette Politique de Confidentialité sont effectives lorsqu'elles sont publiées sur cette page.",
        "contact": "Me Contacter",
        "contactText": "Si vous avez des questions sur cette Politique de Confidentialité, vous pouvez me contacter :",
        "contactEmail": "Par email : bougenaay@icloud.com"
    },
    "ar": {
        "title": "سياسة الخصوصية لتطبيق Stocky pêche",
        "lastUpdated": "آخر تحديث : 22 يناير 2025",
        "intro": "تصف سياسة الخصوصية هذه الإجراءات والسياسات المتعلقة بجمع واستخدام وكشف معلوماتك عند استخدامك للخدمة. كما تخبرك عن حقوقك في الخصوصية وكيف يحميك القانون.",
        "interpretation": "التفسير والتعريفات",
        "interpretationText": "الكلمات التي تبدأ بحرف كبير لها معاني محددة في الشروط التالية. التعريفات التالية لها نفس المعنى سواء ظهرت في المفرد أو الجمع.",
        "definitions": "التعريفات",
        "definitionsText": "لأغراض سياسة الخصوصية هذه :",
        "account": "الحساب",
        "accountDefinition": "يعني حسابًا فريدًا تم إنشاؤه للسماح لك بالوصول إلى خدمتي أو أجزاء منها.",
        "application": "التطبيق",
        "applicationDefinition": "يعني Stocky pêche، البرنامج الذي قمت بتطويره.",
        "developer": "المطور",
        "developerDefinition": "(يشار إليه بـ \"أنا\" أو \"لي\" في هذه الاتفاقية) يعني معاي بوها، المطور المسؤول عن إنشاء وصيانة التطبيق.",
        "country": "البلد",
        "countryDefinition": "يعني : موريتانيا.",
        "device": "الجهاز",
        "deviceDefinition": "يعني أي جهاز يمكنه الوصول إلى الخدمة، مثل الكمبيوتر أو الهاتف المحمول أو الجهاز اللوحي.",
        "personalData": "البيانات الشخصية",
        "personalDataDefinition": "يعني أي معلومات تتعلق بشخص محدد أو يمكن تحديده.",
        "service": "الخدمة",
        "serviceDefinition": "يعني التطبيق.",
        "serviceProvider": "مزود الخدمة",
        "serviceProviderDefinition": "يعني أي شخص طبيعي أو اعتباري يعالج البيانات نيابة عني. ويشمل ذلك أطرافًا ثالثة أو أفرادًا يعملون لتسهيل الخدمة أو تقديمها نيابة عني أو تنفيذ خدمات مرتبطة بالخدمة أو مساعدتي في تحليل كيفية استخدام الخدمة.",
        "usageData": "بيانات الاستخدام",
        "usageDataDefinition": "يعني البيانات التي يتم جمعها تلقائيًا، إما من خلال استخدام الخدمة أو من البنية التحتية للخدمة نفسها (على سبيل المثال، مدة زيارة الصفحة).",
        "you": "أنت",
        "youDefinition": "يعني الفرد الذي يصل إلى الخدمة أو يستخدمها، أو الشركة، أو أي كيان قانوني آخر نيابة عن هذا الفرد.",
        "collectingData": "جمع واستخدام بياناتك الشخصية",
        "typesOfData": "أنواع البيانات التي يتم جمعها",
        "personalDataSection": "البيانات الشخصية",
        "personalDataSectionText": "عند استخدامك للخدمة، قد أطلب منك تقديم معلومات شخصية معينة يمكن استخدامها للاتصال بك أو التعرف عليك. قد تشمل المعلومات الشخصية القابلة للتحديد، على سبيل المثال لا الحصر:",
        "personalDataList": [
            "الاسم الأول واسم العائلة",
            "رقم الهاتف",
            "العنوان، الولاية، المقاطعة، الرمز البريدي، المدينة",
            "بيانات الاستخدام"
        ],
        "usageDataSection": "بيانات الاستخدام",
        "usageDataSectionText": "يتم جمع بيانات الاستخدام تلقائيًا عند استخدام الخدمة.",
        "usageDataDetails": "قد تتضمن بيانات الاستخدام معلومات مثل عنوان IP لجهازك، ونوع المتصفح، وإصدار المتصفح، وصفحات الخدمة التي تزورها، ووقت وتاريخ زيارتك، والوقت الذي تقضيه على تلك الصفحات، ومعرفات فريدة للجهاز، وبيانات تشخيصية أخرى.",
        "mobileUsage": "عند الوصول إلى الخدمة عبر جهاز محمول، قد يتم جمع بعض المعلومات تلقائيًا، بما في ذلك، على سبيل المثال لا الحصر، نوع الجهاز المحمول الذي تستخدمه، والمعرف الفريد لجهازك المحمول، وعنوان IP لجهازك المحمول، ونظام التشغيل المحمول الخاص بك، ونوع متصفح الإنترنت المحمول الذي تستخدمه، ومعرفات فريدة للجهاز، وبيانات تشخيصية أخرى.",
        "browserData": "قد أقوم أيضًا بجمع المعلومات التي يرسلها متصفحك في كل مرة تزور فيها خدمتي أو عندما تصل إلى الخدمة عبر جهاز محمول.",
        "useOfData": "استخدام بياناتك الشخصية",
        "useOfDataText": "قد أستخدم البيانات الشخصية للأغراض التالية:",
        "useOfDataList": [
            "لتوفير الخدمة والحفاظ عليها، بما في ذلك مراقبة استخدام الخدمة.",
            "لإدارة حسابك: لإدارة تسجيلك كمستخدم للخدمة. قد تمنحك البيانات الشخصية التي تقدمها إمكانية الوصول إلى ميزات مختلفة للخدمة المتاحة لك كمستخدم مسجل.",
            "للتواصل معك: للتواصل معك عبر البريد الإلكتروني، أو المكالمات الهاتفية، أو الرسائل النصية القصيرة، أو غيرها من أشكال الاتصال الإلكتروني المماثلة، مثل إشعارات الدفع من التطبيق المحمول فيما يتعلق بالتحديثات أو الاتصالات الإعلامية المتعلقة بالميزات أو المنتجات أو الخدمات المتعاقد عليها، بما في ذلك تحديثات الأمان، عند الضرورة أو المعقول لتنفيذها.",
            "لتزويدك بالأخبار والعروض الخاصة والمعلومات العامة حول السلع والخدمات والأحداث الأخرى التي أقدمها والتي تشبه تلك التي اشتريتها بالفعل أو استفسرت عنها، إلا إذا اخترت عدم تلقي مثل هذه المعلومات.",
            "لإدارة طلباتك: للرد على طلباتك وإدارتها.",
            "لأغراض أخرى: قد أستخدم معلوماتك لأغراض أخرى، مثل تحليل البيانات، وتحديد اتجاهات الاستخدام، وتحديد فعالية حملاتي الترويجية، وتقييم وتحسين خدمتي ومنتجاتي وخدماتي وتسويقي وتجربتك."
        ],
        "sharingData": "مشاركة بياناتك الشخصية",
        "sharingDataText": "قد أشارك معلوماتك الشخصية في الحالات التالية:",
        "sharingDataList": [
            "مع مزودي الخدمة: قد أشارك معلوماتك الشخصية مع مزودي الخدمة لمراقبة وتحليل استخدام خدمتي، وللاتصال بك.",
            "بموافقتك: قد أفصح عن معلوماتك الشخصية لأي غرض آخر بموافقتك."
        ],
        "retention": "الاحتفاظ ببياناتك الشخصية",
        "retentionText": "سأحتفظ ببياناتك الشخصية فقط طالما كان ذلك ضروريًا للأغراض الموضحة في سياسة الخصوصية هذه. سأحتفظ ببياناتك الشخصية وأستخدمها بالقدر اللازم للامتثال لالتزاماتي القانونية (على سبيل المثال، إذا كنت ملزمًا بالاحتفاظ ببياناتك للامتثال للقوانين المعمول بها)، وحل النزاعات، وإنفاذ اتفاقياتي وسياساتي القانونية.",
        "retentionUsageData": "سأحتفظ أيضًا ببيانات الاستخدام لأغراض التحليل الداخلي. يتم الاحتفاظ ببيانات الاستخدام عمومًا لفترة زمنية أقصر، إلا عندما يتم استخدام هذه البيانات لتعزيز الأمان أو تحسين وظائف خدمتي، أو عندما أكون ملزمًا قانونيًا بالاحتفاظ بهذه البيانات لفترات زمنية أطول.",
        "transfer": "نقل بياناتك الشخصية",
        "transferText": "يتم معالجة معلوماتك، بما في ذلك البيانات الشخصية، في مكتبي وفي أي مكان آخر توجد فيه الأطراف المشاركة في المعالجة. هذا يعني أن هذه المعلومات قد يتم نقلها إلى — والاحتفاظ بها على — أجهزة كمبيوتر تقع خارج ولايتك أو مقاطعتك أو بلدك أو أي ولاية قضائية حكومية أخرى حيث قد تختلف قوانين حماية البيانات عن تلك الموجودة في ولايتك القضائية.",
        "transferConsent": "يمثل موافقتك على سياسة الخصوصية هذه متبوعًا بتقديمك لهذه المعلومات موافقتك على هذا النقل.",
        "transferSecurity": "سأتخذ جميع الخطوات المعقولة اللازمة لضمان معالجة بياناتك بشكل آمن ووفقًا لسياسة الخصوصية هذه، ولن يتم نقل بياناتك الشخصية إلى منظمة أو بلد ما لم تكن هناك ضوابط كافية بما في ذلك أمان بياناتك ومعلوماتك الشخصية الأخرى.",
        "deletion": "حذف بياناتك الشخصية",
        "deletionText": "لديك الحق في حذف أو طلب مساعدتي في حذف البيانات الشخصية التي جمعتها عنك.",
        "deletionService": "قد تمنحك خدمتي القدرة على حذف بعض المعلومات المتعلقة بك من داخل الخدمة.",
        "deletionAccount": "يمكنك تحديث أو تعديل أو حذف معلوماتك في أي وقت عن طريق تسجيل الدخول إلى حسابك، إذا كان لديك حساب، وزيارة قسم إعدادات الحساب الذي يسمح لك بإدارة معلوماتك الشخصية. يمكنك أيضًا الاتصال بي لطلب الوصول إلى معلوماتك الشخصية التي قدمتها لي أو تصحيحها أو حذفها.",
        "deletionNote": "يرجى ملاحظة، مع ذلك، أنني قد أكون ملزمًا بالاحتفاظ ببعض المعلومات عندما يكون لدي التزام قانوني أو أساس قانوني للقيام بذلك.",
        "disclosure": "الكشف عن بياناتك الشخصية",
        "disclosureLaw": "تطبيق القانون",
        "disclosureLawText": "في ظل ظروف معينة، قد أكون ملزمًا بالكشف عن بياناتك الشخصية إذا طلب القانون ذلك أو استجابة لطلبات صالحة من السلطات العامة (على سبيل المثال، محكمة أو وكالة حكومية).",
        "disclosureLegal": "التزامات قانونية أخرى",
        "disclosureLegalText": "قد أكشف عن بياناتك الشخصية إذا كنت أعتقد بحسن نية أن هذا الإجراء ضروري من أجل:",
        "disclosureLegalList": [
            "الامتثال لالتزام قانوني",
            "حماية والدفاع عن حقوقي أو ممتلكاتي",
            "منع أو التحقيق في أي أعمال غير مشروعة فيما يتعلق بالخدمة",
            "حماية السلامة الشخصية لمستخدمي الخدمة أو العامة",
            "الحماية من المسؤولية القانونية"
        ],
        "security": "أمان بياناتك الشخصية",
        "securityText": "أمان بياناتك الشخصية مهم بالنسبة لي، ولكن تذكر أنه لا توجد طريقة نقل عبر الإنترنت أو طريقة تخزين إلكتروني آمنة بنسبة 100٪. بينما أسعى جاهدًا لاستخدام وسائل مقبولة تجاريًا لحماية بياناتك الشخصية، لا يمكنني ضمان أمانها المطلق.",
        "childrenPrivacy": "خصوصية الأطفال",
        "childrenPrivacyText": "لا تخاطب خدمتي أي شخص يقل عمره عن 13 عامًا. لا أقوم بجمع معلومات شخصية قابلة للتحديد عن قصد من أي شخص يقل عمره عن 13 عامًا. إذا كنت والدًا أو وصيًا وكنت تعلم أن طفلك قد زودني ببيانات شخصية، يرجى الاتصال بي. إذا اكتشفت أنني قمت بجمع بيانات شخصية من أي شخص يقل عمره عن 13 عامًا دون التحقق من موافقة الوالدين، فسأتخذ خطوات لإزالة هذه المعلومات من خوادمي.",
        "childrenConsent": "إذا كنت بحاجة إلى الاعتماد على الموافقة كأساس قانوني لمعالجة معلوماتك ويتطلب بلدك موافقة الوالدين، فقد أطلب موافقة والدك قبل جمع واستخدام هذه المعلومات.",
        "links": "روابط لمواقع ويب أخرى",
        "linksText": "قد تحتوي خدمتي على روابط لمواقع ويب أخرى لا أدارها. إذا نقرت على رابط تابع لجهة خارجية، فسيتم توجيهك إلى موقع تلك الجهة الخارجية. أنصحك بشدة بمراجعة سياسة الخصوصية لكل موقع تزوره.",
        "linksResponsibility": "ليس لدي أي سيطرة ولا أتحمل أي مسؤولية عن محتوى أو سياسات الخصوصية أو ممارسات أي مواقع أو خدمات تابعة لجهات خارجية.",
        "changes": "تغييرات سياسة الخصوصية هذه",
        "changesText": "قد أقوم بتحديث سياسة الخصوصية الخاصة بي من وقت لآخر. سأخطرك بأي تغييرات عن طريق نشر سياسة الخصوصية الجديدة على هذه الصفحة.",
        "changesAdvice": "أنصحك بمراجعة سياسة الخصوصية هذه بشكل دوري لأي تغييرات. تصبح التغييرات التي يتم إجراؤها على سياسة الخصوصية هذه فعالة عند نشرها على هذه الصفحة.",
        "contact": "الاتصال بي",
        "contactText": "إذا كانت لديك أي أسئلة حول سياسة الخصوصية هذه، يمكنك الاتصال بي:",
        "contactEmail": "عبر البريد الإلكتروني: bougenaay@icloud.com"
    },
    "en": {
        "title": "Privacy Policy for Stocky pêche",
        "lastUpdated": "Last updated: January 22, 2025",
        "intro": "This Privacy Policy describes my policies and procedures on the collection, use, and disclosure of your information when you use the Service. It also informs you about your privacy rights and how the law protects you.",
        "interpretation": "Interpretation and Definitions",
        "interpretationText": "Words with initial capital letters have defined meanings under the following conditions. The following definitions have the same meaning regardless of whether they appear in singular or plural.",
        "definitions": "Definitions",
        "definitionsText": "For the purposes of this Privacy Policy:",
        "account": "Account",
        "accountDefinition": "means a unique account created for you to access my Service or parts of my Service.",
        "application": "Application",
        "applicationDefinition": "means Stocky pêche, the software program I developed.",
        "developer": "Developer",
        "developerDefinition": "(referred to as \"I\", \"Me\", or \"My\" in this Agreement) means Maaye Bouha, the developer responsible for creating and maintaining the Application.",
        "country": "Country",
        "countryDefinition": "means: Mauritania.",
        "device": "Device",
        "deviceDefinition": "means any device that can access the Service, such as a computer, mobile phone, or digital tablet.",
        "personalData": "Personal Data",
        "personalDataDefinition": "means any information relating to an identified or identifiable individual.",
        "service": "Service",
        "serviceDefinition": "means the Application.",
        "serviceProvider": "Service Provider",
        "serviceProviderDefinition": "means any natural or legal person who processes data on my behalf. It refers to third parties or individuals employed to facilitate the Service, provide the Service on my behalf, perform services related to the Service, or assist me in analyzing how the Service is used.",
        "usageData": "Usage Data",
        "usageDataDefinition": "means data collected automatically, either generated by the use of the Service or from the Service infrastructure itself (for example, the duration of a page visit).",
        "you": "You",
        "youDefinition": "means the individual accessing or using the Service, or the company, or other legal entity on behalf of which such individual is accessing or using the Service, as applicable.",
        "collectingData": "Collecting and Using Your Personal Data",
        "typesOfData": "Types of Data Collected",
        "personalDataSection": "Personal Data",
        "personalDataSectionText": "While using my Service, I may ask you to provide me with certain personally identifiable information that can be used to contact or identify you. Personally identifiable information may include, but is not limited to:",
        "personalDataList": [
            "First name and last name",
            "Phone number",
            "Address, State, Province, ZIP/Postal code, City",
            "Usage Data"
        ],
        "usageDataSection": "Usage Data",
        "usageDataSectionText": "Usage Data is collected automatically when using the Service.",
        "usageDataDetails": "Usage Data may include information such as your Device's Internet Protocol address (e.g. IP address), browser type, browser version, the pages of my Service that you visit, the time and date of your visit, the time spent on those pages, unique device identifiers, and other diagnostic data.",
        "mobileUsage": "When you access the Service by or through a mobile device, I may collect certain information automatically, including, but not limited to, the type of mobile device you use, your mobile device unique ID, the IP address of your mobile device, your mobile operating system, the type of mobile Internet browser you use, unique device identifiers, and other diagnostic data.",
        "browserData": "I may also collect information that your browser sends whenever you visit my Service or when you access the Service by or through a mobile device.",
        "useOfData": "Use of Your Personal Data",
        "useOfDataText": "I may use Personal Data for the following purposes:",
        "useOfDataList": [
            "To provide and maintain my Service, including to monitor the usage of my Service.",
            "To manage Your Account: to manage Your registration as a user of the Service. The Personal Data You provide can give You access to different functionalities of the Service that are available to You as a registered user.",
            "To contact You: To contact You by email, telephone calls, SMS, or other equivalent forms of electronic communication, such as a mobile application's push notifications regarding updates or informative communications related to the functionalities, products or contracted services, including the security updates, when necessary or reasonable for their implementation.",
            "To provide You with news, special offers, and general information about other goods, services, and events which I offer that are similar to those that you have already purchased or enquired about unless You have opted not to receive such information.",
            "To manage Your requests: To attend and manage Your requests to Me.",
            "For other purposes: I may use Your information for other purposes, such as data analysis, identifying usage trends, determining the effectiveness of my promotional campaigns, and to evaluate and improve my Service, products, services, marketing, and your experience."
        ],
        "sharingData": "Sharing Your Personal Data",
        "sharingDataText": "I may share Your personal information in the following situations:",
        "sharingDataList": [
            "With Service Providers: I may share Your personal information with Service Providers to monitor and analyze the use of my Service, to contact You.",
            "With Your consent: I may disclose Your personal information for any other purpose with Your consent."
        ],
        "retention": "Retention of Your Personal Data",
        "retentionText": "I will retain Your Personal Data only for as long as is necessary for the purposes set out in this Privacy Policy. I will retain and use Your Personal Data to the extent necessary to comply with my legal obligations (for example, if I am required to retain your data to comply with applicable laws), resolve disputes, and enforce my legal agreements and policies.",
        "retentionUsageData": "I will also retain Usage Data for internal analysis purposes. Usage Data is generally retained for a shorter period of time, except when this data is used to strengthen the security or to improve the functionality of my Service, or I am legally obligated to retain this data for longer time periods.",
        "transfer": "Transfer of Your Personal Data",
        "transferText": "Your information, including Personal Data, is processed at my operating offices and in any other places where the parties involved in the processing are located. It means that this information may be transferred to — and maintained on — computers located outside of Your state, province, country, or other governmental jurisdiction where the data protection laws may differ than those from Your jurisdiction.",
        "transferConsent": "Your consent to this Privacy Policy followed by Your submission of such information represents Your agreement to that transfer.",
        "transferSecurity": "I will take all steps reasonably necessary to ensure that Your data is treated securely and in accordance with this Privacy Policy and no transfer of Your Personal Data will take place to an organization or a country unless there are adequate controls in place including the security of Your data and other personal information.",
        "deletion": "Delete Your Personal Data",
        "deletionText": "You have the right to delete or request that I assist in deleting the Personal Data that I have collected about You.",
        "deletionService": "My Service may give You the ability to delete certain information about You from within the Service.",
        "deletionAccount": "You may update, amend, or delete Your information at any time by signing in to Your Account, if you have one, and visiting the account settings section that allows you to manage Your personal information. You may also contact Me to request access to, correct, or delete any personal information that You have provided to Me.",
        "deletionNote": "Please note, however, that I may need to retain certain information when I have a legal obligation or lawful basis to do so.",
        "disclosure": "Disclosure of Your Personal Data",
        "disclosureLaw": "Law enforcement",
        "disclosureLawText": "Under certain circumstances, I may be required to disclose Your Personal Data if required to do so by law or in response to valid requests by public authorities (e.g. a court or a government agency).",
        "disclosureLegal": "Other legal requirements",
        "disclosureLegalText": "I may disclose Your Personal Data in the good faith belief that such action is necessary to:",
        "disclosureLegalList": [
            "Comply with a legal obligation",
            "Protect and defend my rights or property",
            "Prevent or investigate possible wrongdoing in connection with the Service",
            "Protect the personal safety of Users of the Service or the public",
            "Protect against legal liability"
        ],
        "security": "Security of Your Personal Data",
        "securityText": "The security of Your Personal Data is important to Me, but remember that no method of transmission over the Internet, or method of electronic storage is 100% secure. While I strive to use commercially acceptable means to protect Your Personal Data, I cannot guarantee its absolute security.",
        "childrenPrivacy": "Children's Privacy",
        "childrenPrivacyText": "My Service does not address anyone under the age of 13. I do not knowingly collect personally identifiable information from anyone under the age of 13. If You are a parent or guardian and You are aware that Your child has provided Me with Personal Data, please contact Me. If I become aware that I have collected Personal Data from anyone under the age of 13 without verification of parental consent, I take steps to remove that information from My servers.",
        "childrenConsent": "If I need to rely on consent as a legal basis for processing Your information and Your country requires consent from a parent, I may require Your parent's consent before I collect and use that information.",
        "links": "Links to Other Websites",
        "linksText": "My Service may contain links to other websites that are not operated by Me. If You click on a third party link, You will be directed to that third party's site. I strongly advise You to review the Privacy Policy of every site You visit.",
        "linksResponsibility": "I have no control over and assume no responsibility for the content, privacy policies, or practices of any third party sites or services.",
        "changes": "Changes to this Privacy Policy",
        "changesText": "I may update My Privacy Policy from time to time. I will notify You of any changes by posting the new Privacy Policy on this page.",
        "changesAdvice": "You are advised to review this Privacy Policy periodically for any changes. Changes to this Privacy Policy are effective when they are posted on this page.",
        "contact": "Contact Me",
        "contactText": "If you have any questions about this Privacy Policy, You can contact Me:",
        "contactEmail": "By email: bougenaay@icloud.com"
    }
}